In [ ]:
import pandas as pd
import numpy as np
from csv import *

In [1]:
import pandas as pd

# Define a dictionary
b = {
    'Name': ['a', 'b', 'c', 'd'],
    'Age': [27, 24, 22, 32],
    'Address': ['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
    'Qualification': ['Msc', 'MA', 'MCA', 'Phd']
}

# Convert the dictionary into DataFrame
df = pd.DataFrame(b)

# Select specific columns
print(df[['Name', 'Qualification', 'Address', 'Age']])

# Alternatively, you can use df.iloc to select columns by index
print(df.iloc[:, 0:4])  # Selecting columns from index 0 to 3 (inclusive)

  Name Qualification    Address  Age
0    a           Msc      Delhi   27
1    b            MA     Kanpur   24
2    c           MCA  Allahabad   22
3    d           Phd    Kannauj   32
  Name  Age    Address Qualification
0    a   27      Delhi           Msc
1    b   24     Kanpur            MA
2    c   22  Allahabad           MCA
3    d   32    Kannauj           Phd

In [5]:
df.loc[1:3,['Name', 'Qualification']]

  Name Qualification
1    P            MA
2    G           MCA
3    A           Phd

In [7]:
df.iloc[:,0:2]

  Name  Age
0    J   27
1    P   24
2    G   22
3    A   32

In [8]:
df.iloc[0:2,1:3]

   Age Address
0   27   Delhi
1   24  Kanpur

In [20]:
import pandas as pd

b = {
    'Name': ['amit', 'bhavik', 'shrija', 'atharva','sai','nayan','aditi','shri','maya','shubhada'],
    'Std': [4,3,2,1,4,6,7,3,8,1],
    'Rollno': [12,15,17,13,14,11,10,18,19,16], 
    'score': [97,90,87,80,85,67,78,79,95,92],
    'div': ['a', 'b', 'c', 'd','a', 'b', 'c', 'd','a','c']
}

df = pd.DataFrame(b)


df.to_csv('dataset.csv', index=False)
print(b)

{'Name': ['amit', 'bhavik', 'shrija', 'atharva', 'sai', 'nayan', 'aditi', 'shri', 'maya', 'shubhada'], 'Std': [4, 3, 2, 1, 4, 6, 7, 3, 8, 1], 'Rollno': [12, 15, 17, 13, 14, 11, 10, 18, 19, 16], 'score': [97, 90, 87, 80, 85, 67, 78, 79, 95, 92], 'div': ['a', 'b', 'c', 'd', 'a', 'b', 'c', 'd', 'a', 'c']}

In [21]:
df[df.columns[1:6]] # accessing columns

   Std  Rollno  score div
0    4      12     97   a
1    3      15     90   b
2    2      17     87   c
3    1      13     80   d
4    4      14     85   a
5    6      11     67   b
6    7      10     78   c
7    3      18     79   d
8    8      19     95   a
9    1      16     92   c

In [22]:
df.loc[1:8,['Name','div']]

      Name div
1   bhavik   b
2   shrija   c
3  atharva   d
4      sai   a
5    nayan   b
6    aditi   c
7     shri   d
8     maya   a

In [37]:
df.iloc[0:5,1:6] #iloc

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [32]:
df = df.drop(index=5)
print(df)

      Name  Std  Rollno  score div
0     amit    4      12     97   a
1   bhavik    3      15     90   b
2   shrija    2      17     87   c
3  atharva    1      13     80   d
4      sai    4      14     85   a
6    aditi    7      10     78   c
7     shri    3      18     79   d
8     maya    8      19     95   a

In [33]:
print(df.transpose())

           0       1       2        3    4      6     7     8
Name    amit  bhavik  shrija  atharva  sai  aditi  shri  maya
Std        4       3       2        1    4      7     3     8
Rollno    12      15      17       13   14     10    18    19
score     97      90      87       80   85     78    79    95
div        a       b       c        d    a      c     d     a